
# FocusDown Summary
# 292 layers, 8341791 parameters, 4764063 gradients, 17.2 GFLOPs


# Parameters
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
nc: 80  # number of classes, required
nk: 0   # num of keypoints, (required, specify in data/project/xxx.yaml)


backbone:
  # [from, number, module, args] 
  [
   [-1, 1, Patchify, [64, 4]],              # 0 P1 ~ 2 / 4
   # [-1, 1, AsymFocus, [128]],              # ch: 64->128
   [-1, 1, RepConv, [256, 3, 2]],         # 1-P3/8
   [-1, 6, C3xESE, [256, False, True]],   # 2 (c1, c2, n=1, ese=True, shortcut=True)
   [-1, 1, RepConv, [512, 3, 2]],         # 3 -P4/16
   [-1, 9, C3xESE, [512, False, True]],   # 4
   [-1, 1, AsymConv, [1024, 3, 2]],       # 5-P5/32
   [-1, 3, C3xESE, [1024, False, True]],  # 6
   [-1, 1, SPPF, [1024, 5]],              # 7       
  ]
  

neck:
  [[-1, 1, Conv, [512, 1, 1]],  # 8
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],   # 9
   [[-1, 4], 1, Concat, [1]],   # cat backbone P4 10
   [-1, 3, C3xESE, [512, False, False]],    # 11    (self, c1, c2, ese=True, shortcut=True) 

   [-1, 1, Conv, [256, 1, 1]],  # 12
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 13
   [[-1, 2], 1, Concat, [1]],   # cat backbone P3 14
   [-1, 3, C3xESE, [256, False, False]],    # 22 (P3/8-small) -> 15

   [-1, 1, AsymConv, [256, 3, 2]],  # 16
   [[-1, 12], 1, Concat, [1]],    # cat head P4  17 
   [-1, 3, C3xESE, [512, False, False]],    # 26 (P4/16-medium)  -> 18

   [-1, 1, AsymConv, [512, 3, 2]],    # [-1, 1, DWConv, [512, 5, 2]],   19
   [[-1, 8], 1, Concat, [1]],    # cat head P5  20
   [-1, 3, C3xESE, [1024, True, False]],    # 21 (P5/32-large)    => has attention
  ]

head:
  [
   [[15, 18, 21], 1, Detect, [nc, nk]],    # Detect(P3, P4, P5)
  ]
