
# Parameters
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple


architure:
  [ # [from, number, module, args] 
    # backbone 
    [-1, 1, Extract, [64, 3, 2]],           # 0 P1 / 2
    # [-1, 1, Conv, [64, 3, 2]],          # 0 P1 / 2
    [-1, 1, RepConvs, [128, 3, 2]],         # 1-P2/4
    [-1, 3, CPN, [128, 2]],             # 2   
    [-1, 1, RepConvs, [256, 3, 2]],         # 3-P3/8
    [-1, 3, CPN, [256, 2]],             # 4 
    [-1, 1, RepConvs, [512, 3, 2]],         # 5 -P4/16
    [-1, 3, CPN, [512, 2]],             # 6
    [-1, 1, RepConvs, [1024, 3, 2]],        # 7-P5/32
    [-1, 3, CPN, [1024, 2]],            # 8
    [-1, 1, SPPF, [1024, 5]],           # 9       

    # neck
    [-1, 1, Conv, [512, 1, 1]],    # 10
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],   # 11
    [[-1, 6], 1, Concat, [1]],     # cat backbone P4 12
    [-1, 6, C3x, [512]],    # 13   

    [-1, 1, Conv, [256, 1, 1]],    # 14
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 15
    [[-1, 4], 1, Concat, [1]],     # cat backbone P3 16
    [-1, 6, C3x, [256]],    # (P3/8-small) -> 17

    [-1, 1, DWConv, [256, 3, 2]],    # 18   
    [-1, 1, Conv, [256, 1, 1]],    # 19  
    [[-1, 14], 1, Concat, [1]],    # cat head P4  20 
    [-1, 6, C3x, [512]],    # (P4/16-medium)  -> 21   # [-1, 6, LiteCSP, [512, False, False]]  # [-1, 6, C3x, [512, False]]

    [-1, 1, DWConv, [512, 5, 2]],    # 22   
    [-1, 1, Conv, [512, 1, 1]],    # 23   
    [[-1, 10], 1, Concat, [1]],    # cat head P5  24
    [-1, 6, C3x, [1024]],    # 25 (P5/32-large)   

    # head:
    [17, 1, RepConvs, [256, 1, 1]],    # P3  
    [21, 1, RepConvs, [512, 1, 1]],    # P4
    [25, 1, RepConvs, [1024, 1, 1]],    # P5
    [[-3, -2, -1], 1, Detect, []],     # Detect(P3, P4, P5)

  ]
