
# Parameters
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple


architure:
  [ # [from, number, module, args] 
    # backbone 
    [-1, 1, Conv, [64, 3, 2]],      # 0 P1 / 2
    [-1, 1, Conv, [128, 3, 2]],          # 1-P2/4
    [-1, 3, S4, [128]],                   # 2   
    [-1, 1, Conv, [256, 3, 2]],         # 3-P3/8
    [-1, 3, S4, [256]],                   # 4 
    [-1, 1, Conv, [512, 3, 2]],         # 5 -P4/16
    [-1, 3, S4, [512]],                  # 6
    [-1, 1, Conv, [1024, 3, 2]],       # 7-P5/32
    [-1, 3, S4, [1024]],                    # 8
    [-1, 1, SPPF, [512, 5]],              # 9       

    # neck
    # [-1, 1, Conv, [512, 1, 1]],    # 10
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],   # 11
    [[-1, 6], 1, Concat, [1]],     # cat backbone P4 12
    [-1, 6, LCA, [512, False, False]],    # 13   
    # [-1, 3, C3, [512, False]],    # 13   
    # [-1, 3, STAIRS, [512]],    # 13  


    [-1, 1, Conv, [256, 1, 1]],    # 14
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 15
    [[-1, 4], 1, Concat, [1]],     # cat backbone P3 16
    [-1, 6, LCA, [256, False, False]],    # 22 (P3/8-small) -> 17
    # [-1, 3, C3, [256, False]],    # 22 (P3/8-small) -> 17
    # [-1, 3, STAIRS, [256]],    # 22 (P3/8-small) -> 17

    [-1, 1, Conv, [256, 3, 2]],    # 18   
    [[-1, 13], 1, Concat, [1]],    # cat head P4  19 
    [-1, 3, LCA, [512, False, True]],    # 26 (P4/16-medium)  -> 20
    # [-1, 3, C3, [512, False]],    # 26 (P4/16-medium)  -> 20
    # [-1, 3, STAIRS, [512]],    # 26 (P4/16-medium)  -> 20

    [-1, 1, Conv, [512, 3, 2]],    # 21   
    [[-1, 9], 1, Concat, [1]],    # cat head P5  22
    [-1, 3, LCA, [1024, False, True]],    # 23 (P5/32-large)   
    # [-1, 3, STAIRS, [1024]],    # 23 (P5/32-large)   
    # [-1, 3, C3, [1024, False]],    # 23 (P5/32-large)   

    # head:
    [[16, 19, 22], 1, Detect, []],     # Detect(P3, P4, P5)

  ]
