
# Parameters
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple


architure:
  [ # [from, number, module, args] 
    # backbone 
    # [-1, 1, Conv, [64, 3, 2]],            # 0 P1 / 2
    [-1, 1, Extract, [64, 3, 2]],           # 0 P1 / 2
    [-1, 1, Conv, [128, 3, 2]],             # 0 
    [-1, 3, LiteCSP, [128, True, False]],             # 2   
    [-1, 1, Conv, [256, 3, 2]],         # 3-P3/8
    [-1, 6, LiteCSP, [256, True, False]],             # 4 
    [-1, 1, Conv, [512, 3, 2]],         # 5 -P4/16
    [-1, 9, LiteCSP, [512, True, False]],             # 6
    [-1, 1, Conv, [1024, 3, 2]],        # 7-P5/32
    [-1, 3, LiteCSP, [1024, True, False]],            # 8
    [-1, 1, SPPF, [1024, 5]],           # 9           

    # neck
    [-1, 1, Conv, [512, 1, 1]],    # 10
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],   # 11
    [[-1, 6], 1, Concat, [1]],     # cat backbone P4 12
    [-1, 3, S3, [512]],    # 13   
    # [-1, 6, LiteCSP, [512, False, False]],    # 13   
    # [-1, 3, C3x, [512, False]],    # 13   

    [-1, 1, Conv, [256, 1, 1]],    # 14
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 15
    [[-1, 4], 1, Concat, [1]],     # cat backbone P3 16
    [-1, 3, S3, [256]],    # 13   
    # [-1, 6, LiteCSP, [256, False, False]],    # 22 (P3/8-small) -> 17
    # [-1, 3, C3x, [256, False]],    # 22 (P3/8-small) -> 17


    [-1, 1, Conv, [256, 3, 2]],    # 18   
    [[-1, 14], 1, Concat, [1]],    # cat head P4  19 
    [-1, 3, S3, [512]],    # 13   
    # [-1, 3, LiteCSP, [512, False, False]],    # 26 (P4/16-medium)  -> 20
    # [-1, 3, C3x, [512, False]],    # 26 (P4/16-medium)  -> 20

    [-1, 1, Conv, [512, 3, 2]],    # 21   
    [[-1, 10], 1, Concat, [1]],    # cat head P5  22
    [-1, 3, S3, [1024]],    # 13   
    # [-1, 3, LiteCSP, [1024, False, False]],    # 23 (P5/32-large)   
    # [-1, 3, C3x, [1024, False]],    # 23 (P5/32-large) 

    # head:
    # [[16, 19, 22], 1, Detect, []],     # Detect(P3, P4, P5)
    # [[17, 20, 23], 1, Detect, []],     # Detect(P3, P4, P5)
    # [[18, 22, 26], 1, Detect, []],     # Detect(P3, P4, P5)
    [17, 1, Conv, [256, 1, 1]],    # P3  
    [20, 1, Conv, [512, 1, 1]],    # P4
    [23, 1, Conv, [1024, 1, 1]],    # P5
    [[-3, -2, -1], 1, Detect, []],     # Detect(P3, P4, P5)

  ]
