
# update
tag: 'YOLOX'   # 'YOLOV5' default
nkpt: 17  # not used right now

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
anchors: 1
  # - [10,13, 16,30, 33,23]  # P3/8
  # - [30,61, 62,45, 59,119]  # P4/16
  # - [116,90, 156,198, 373,326]  # P5/32




# [from, number, module, args]
backbone:
  [[-1, 1, RepConv, [64, 3, 2]],  # 0-P1/2
   [-1, 1, RepConv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3x, [128]],
   [-1, 1, RepConv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3x, [256]],
   [-1, 1, RepConv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3x, [512]],
   [-1, 1, RepConv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3x, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

neck:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],   # [-1, 1, DWConvTranspose2d, [512, 4, 2, 1]],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3x, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],   # [-1, 1, DWConvTranspose2d, [256, 4, 2, 1]],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3x, [256, False]],  # 17 (P3/8-small)

   [-1, 1, RepConv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3x, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, DWConv, [512, 5, 2]],  # [-1, 1, RepConv, [512, 3, 2]],  
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3x, [1024, False]],  # 23 (P5/32-large)
  ]

head:
  [
   [[17, 20, 23], 1, DetectX, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
